In [1]:
import pandas as pd

In [2]:
sun_file = "data/sun_data.csv"
city_file = "data/us_cities.csv"

In [3]:
sun_data = pd.read_csv(sun_file)
city_data = pd.read_csv(city_file)

In [4]:
sun_data.head()

,CITY,state,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN
0,BIRMINGHAM,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0
1,MONTGOMERY,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0
2,ANCHORAGE,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0
3,JUNEAU,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0
4,NOME,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0

In [5]:
city_data.head()

   ID STATE_CODE STATE_NAME      CITY          COUNTY   LATITUDE   LONGITUDE
0   1         AK     Alaska      Adak  Aleutians West  55.999722 -161.207778
1   2         AK     Alaska  Akiachak          Bethel  60.891854 -161.392330
2   3         AK     Alaska     Akiak          Bethel  60.890632 -161.199325
3   4         AK     Alaska    Akutan  Aleutians East  54.143012 -165.785368
4   5         AK     Alaska  Alakanuk    Wade Hampton  62.746967 -164.602280

In [6]:
sun_data = sun_data.rename(columns={"state": "STATE_CODE"})

In [7]:
sun_data

,CITY,STATE_CODE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN
0,BIRMINGHAM,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0
1,MONTGOMERY,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0
2,ANCHORAGE,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0
3,JUNEAU,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0
4,NOME,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
153,PAGO PAGO- AMER SAMOA,PC,43.0,45.0,50.0,44.0,38.0,38.0,45,51,57,44,42,40.0,44.0
154,POHNPEI- CAROLINE IS.,PC,40.0,43.0,47.0,43.0,41.0,40.0,40,43,44,38,41,35.0,41.0
155,CHUUK- E. CAROLINE IS.,PC,56.0,62.0,60.0,57.0,52.0,50.0,53,57,51,48,49,51.0,53.0
156,YAP- W CAROLINE IS.,PC,57.0,62.0,66.0,66.0,61.0,55.0,48,49,51,51,57,58.0,56.0
157,SAN JUAN,PR,66.0,69.0,75.0,69.0,58.0,63.0,68,67,65,60,57,57.0,64.0

In [8]:
city_loc = city_data[["CITY", "STATE_CODE", "LATITUDE", "LONGITUDE"]]

In [9]:
city_loc.head()

       CITY STATE_CODE   LATITUDE   LONGITUDE
0      Adak         AK  55.999722 -161.207778
1  Akiachak         AK  60.891854 -161.392330
2     Akiak         AK  60.890632 -161.199325
3    Akutan         AK  54.143012 -165.785368
4  Alakanuk         AK  62.746967 -164.602280

In [10]:
city_loc["CITY"] = city_loc["CITY"].str.title()
sun_data["CITY"] = sun_data["CITY"].str.title()

In [11]:
city_loc.head()

       CITY STATE_CODE   LATITUDE   LONGITUDE
0      Adak         AK  55.999722 -161.207778
1  Akiachak         AK  60.891854 -161.392330
2     Akiak         AK  60.890632 -161.199325
3    Akutan         AK  54.143012 -165.785368
4  Alakanuk         AK  62.746967 -164.602280

In [12]:
sun_data.head()

,CITY,STATE_CODE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN
0,Birmingham,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0
1,Montgomery,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0
2,Anchorage,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0
3,Juneau,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0
4,Nome,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0

In [13]:
merged = pd.merge(sun_data, city_loc, how="inner", on=["CITY", "STATE_CODE"])

merged.head(10)

,CITY,STATE_CODE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN,LATITUDE,LONGITUDE
0,Birmingham,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0,33.519000,-86.801400
1,Birmingham,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0,33.401559,-86.705511
2,Montgomery,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0,32.374300,-86.311800
3,Anchorage,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0,61.211571,-149.876077
4,Juneau,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0,58.362767,-134.529429
5,Nome,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0,64.505775,-165.310667
6,Flagstaff,AZ,71.0,73.0,72.0,82.0,83.0,88.0,74,75,79,77,72,76.0,76.0,35.185911,-111.661979
7,Phoenix,AZ,79.0,81.0,83.0,90.0,93.0,95.0,86,87,89,88,79,79.0,85.0,33.451000,-112.068500
8,Tucson,AZ,80.0,82.0,86.0,92.0,94.0,93.0,80,84,87,88,83,79.0,85.0,32.213873,-110.969445
9,Fort Smith,AR,52.0,56.0,58.0,60.0,63.0,70.0,75,70,63,63,51,51.0,61.0,35.365272,-94.411035

In [14]:
merged_dropped = merged.drop_duplicates(subset=["CITY", "STATE_CODE"])

merged_dropped

,CITY,STATE_CODE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN,LATITUDE,LONGITUDE
0,Birmingham,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0,33.519000,-86.801400
2,Montgomery,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0,32.374300,-86.311800
3,Anchorage,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0,61.211571,-149.876077
4,Juneau,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0,58.362767,-134.529429
5,Nome,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0,64.505775,-165.310667
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,Milwaukee,WI,47.0,51.0,50.0,52.0,60.0,65.0,69,64,57,51,37,35.0,53.0,43.034300,-87.915100
174,Cheyenne,WY,58.0,66.0,67.0,66.0,63.0,64.0,67,70,70,67,56,57.0,64.0,41.143719,-104.796234
175,Lander,WY,63.0,67.0,69.0,65.0,63.0,71.0,74,76,73,66,58,59.0,67.0,42.859678,-108.738288
176,Sheridan,WY,50.0,55.0,61.0,57.0,59.0,65.0,74,74,69,59,52,52.0,60.0,44.784860,-106.964795
177,San Juan,PR,66.0,69.0,75.0,69.0,58.0,63.0,68,67,65,60,57,57.0,64.0,18.465200,-66.107100

In [15]:
merged_dropped = merged_dropped.dropna()

In [16]:
merged_dropped

,CITY,STATE_CODE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN,LATITUDE,LONGITUDE
0,Birmingham,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0,33.519000,-86.801400
2,Montgomery,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0,32.374300,-86.311800
3,Anchorage,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0,61.211571,-149.876077
4,Juneau,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0,58.362767,-134.529429
5,Nome,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0,64.505775,-165.310667
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,Milwaukee,WI,47.0,51.0,50.0,52.0,60.0,65.0,69,64,57,51,37,35.0,53.0,43.034300,-87.915100
174,Cheyenne,WY,58.0,66.0,67.0,66.0,63.0,64.0,67,70,70,67,56,57.0,64.0,41.143719,-104.796234
175,Lander,WY,63.0,67.0,69.0,65.0,63.0,71.0,74,76,73,66,58,59.0,67.0,42.859678,-108.738288
176,Sheridan,WY,50.0,55.0,61.0,57.0,59.0,65.0,74,74,69,59,52,52.0,60.0,44.784860,-106.964795
177,San Juan,PR,66.0,69.0,75.0,69.0,58.0,63.0,68,67,65,60,57,57.0,64.0,18.465200,-66.107100

In [17]:
merged_dropped = merged_dropped.set_index('CITY')

In [20]:
merged_dropped["WINTER"] = (merged_dropped["DEC"] + merged_dropped["JAN"] + merged_dropped["FEB"])/3
merged_dropped["SPRING"] = (merged_dropped["MAR"] + merged_dropped["APR"] + merged_dropped["MAY"])/3
merged_dropped["SUMMER"] = (merged_dropped["JUN"] + merged_dropped["JUL"] + merged_dropped["AUG"])/3
merged_dropped["FALL"] = (merged_dropped["SEP"] + merged_dropped["OCT"] + merged_dropped["NOV"])/3

merged_dropped

,STATE_CODE,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN,LATITUDE,LONGITUDE,WINTER,SPRING,SUMMER,FALL
CITY,,,,,,,,,,,,,,,,,,,,
Birmingham,AL,46.0,53.0,57.0,65.0,65.0,67.0,59,62,59,66,55,49.0,58.0,33.519000,-86.801400,49.333333,62.333333,62.666667,60.000000
Montgomery,AL,47.0,55.0,58.0,64.0,63.0,64.0,61,61,59,63,55,49.0,58.0,32.374300,-86.311800,50.333333,61.666667,62.000000,59.000000
Anchorage,AK,43.0,46.0,51.0,50.0,51.0,46.0,43,43,41,36,35,33.0,43.0,61.211571,-149.876077,40.666667,50.666667,44.000000,37.333333
Juneau,AK,39.0,35.0,38.0,42.0,44.0,37.0,33,35,27,21,26,21.0,33.0,58.362767,-134.529429,31.666667,41.333333,35.000000,24.666667
Nome,AK,38.0,56.0,54.0,52.0,52.0,43.0,39,34,38,35,30,36.0,42.0,64.505775,-165.310667,43.333333,52.666667,38.666667,34.333333
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Milwaukee,WI,47.0,51.0,50.0,52.0,60.0,65.0,69,64,57,51,37,35.0,53.0,43.034300,-87.915100,44.333333,54.000000,66.000000,48.333333
Cheyenne,WY,58.0,66.0,67.0,66.0,63.0,64.0,67,70,70,67,56,57.0,64.0,41.143719,-104.796234,60.333333,65.333333,67.000000,64.333333
Lander,WY,63.0,67.0,69.0,65.0,63.0,71.0,74,76,73,66,58,59.0,67.0,42.859678,-108.738288,63.000000,65.666667,73.666667,65.666667
Sheridan,WY,50.0,55.0,61.0,57.0,59.0,65.0,74,74,69,59,52,52.0,60.0,44.784860,-106.964795,52.333333,59.000000,71.000000,60.000000
San Juan,PR,66.0,69.0,75.0,69.0,58.0,63.0,68,67,65,60,57,57.0,64.0,18.465200,-66.107100,64.000000,67.333333,66.000000,60.666667

In [21]:
merged_dropped.to_csv("Data/merged_sun_data.csv")